<div style="background-color:#e6f5e6;">
<br/>
<div style="text-align:center;">
  <img src="retail_gif.gif" alt="Retail Analytics" style="height:300px; width:400px;">
</div>
<div style="text-align:center; color:black;">
<h2>Capstone Project 7</h2>
<h3>Retail Analytics</h3>
</div><br/>
</div>
<hr/>

### BY GROUP 15 :
| Name               | Registration_Id|
|--------------------|----------------|
| SANJEEP ROUT       | 2041018144     |
| JEET ACHARYA       | 2041001009     |
| PALAK AGARWAL      | 2041001024     |
| AMRUTTA DHAL       | 2041004146     |
| PRIYAJIT GANTAYAT  | 2041007003     |
| RISHU KUMAR        | 2041011066     |

### Details 

A retail company “ABC Private Limited” wants to understand the customer purchase 
behaviour (specifically, purchase amount) against various products of different categories. 
They have shared purchase summary of various customers for selected high-volume products 
from last month.

In [1]:
# libraray imports
import pandas as pd
import seaborn as sns

In [4]:
# files imports 
# a. Load the dataset
user_demographics = r"P:\0011 NOTES\aii+ml-comviva\Capstone_Project_7\user_demographics.csv"
user_purchase_details = r"P:\0011 NOTES\aii+ml-comviva\Capstone_Project_7\User_product_purchase_details_p2.csv"

In [18]:
# data details
df1 = pd.read_csv(user_demographics)
df2 = pd.read_csv(user_purchase_details)

## DATA EXPLORATION

#### 1 user_demographics data

In [22]:
print(df1)

      User_ID Gender    Age  Occupation
0     1000001      F   0-17          10
1     1000002      M    55+          16
2     1000003      M  26-35          15
3     1000004      M  46-50           7
4     1000005      M  26-35          20
...       ...    ...    ...         ...
5886  1004588      F  26-35           4
5887  1004871      M  18-25          12
5888  1004113      M  36-45          17
5889  1005391      M  26-35           7
5890  1001529      M  18-25           4

[5891 rows x 4 columns]

In [36]:
df1.sample(5)

      User_ID Gender    Age  Occupation
4411  1005008      M  26-35          20
4415  1005012      M  51-55          15
2285  1002590      M  18-25           4
3720  1004220      M  36-45           0
2883  1003283      M  36-45          16

In [14]:
print(df1.head)

<bound method NDFrame.head of       User_ID Gender    Age  Occupation
0     1000001      F   0-17          10
1     1000002      M    55+          16
2     1000003      M  26-35          15
3     1000004      M  46-50           7
4     1000005      M  26-35          20
...       ...    ...    ...         ...
5886  1004588      F  26-35           4
5887  1004871      M  18-25          12
5888  1004113      M  36-45          17
5889  1005391      M  26-35           7
5890  1001529      M  18-25           4

[5891 rows x 4 columns]>

In [15]:
print(df1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5891 entries, 0 to 5890
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   User_ID     5891 non-null   int64
 1   Gender      5891 non-null   object
 2   Age         5891 non-null   object
 3   Occupation  5891 non-null   int64
dtypes: int64(2), object(2)
memory usage: 184.2+ KB
None

In [16]:
print(df1.describe())

            User_ID   Occupation
count  5.891000e+03  5891.000000
mean   1.003025e+06     8.153285
std    1.743379e+03     6.323140
min    1.000001e+06     0.000000
25%    1.001518e+06     3.000000
50%    1.003026e+06     7.000000
75%    1.004532e+06    14.000000
max    1.006040e+06    20.000000

In [17]:
print(df1.shape)

(5891, 4)

#### 2 user_purchase_details data

In [23]:
print(df2)

        User_ID Product_ID City_Category Stay_In_Current_City_Years  \
0       1000001  P00069042             A                          2
1       1000001  P00248942             A                          2
2       1000001  P00087842             A                          2
3       1000001  P00085442             A                          2
4       1000002  P00285442             C                         4+
...         ...        ...           ...                        ...
550063  1006033  P00372445             B                          1
550064  1006035  P00375436             C                          3
550065  1006036  P00375436             B                         4+
550066  1006038  P00375436             C                          2
550067  1006039  P00371644             B                         4+

        Marital_Status  Product_Category_1  Product_Category_2  \
0                    0                   3                 NaN
1                    0                   1                 6.0
2                    0                  12                 NaN
3                    0                  12                14.0
4                    0                   8                 NaN
...                ...                 ...                 ...
550063               1                  20                 NaN
550064               0                  20                 NaN
550065               1                  20                 NaN
550066               0                  20                 NaN
550067               1                  20                 NaN

        Product_Category_3  Purchase
0                      NaN      8370
1                     14.0     15200
2                      NaN      1422
3                      NaN      1057
4                      NaN      7969
...                    ...       ...
550063                 NaN       368
550064                 NaN       371
550065                 NaN       137
550066                 NaN       365
550067                 NaN       490

[550068 rows x 9 columns]

In [37]:
df2.sample(5)

,User_ID,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
140317,1003676,P00345842,B,3,1,2,8.0,14.0,9972
501609,1005269,P00150942,B,4+,0,6,11.0,13.0,8618
157694,1000352,P00246342,A,0,0,11,15.0,NaN,6154
505654,1005886,P00247042,A,2,0,5,14.0,NaN,5215
142780,1004016,P00259942,B,1,0,16,NaN,NaN,12116

In [24]:
print(df2.head)

<bound method NDFrame.head of         User_ID Product_ID City_Category Stay_In_Current_City_Years  \
0       1000001  P00069042             A                          2
1       1000001  P00248942             A                          2
2       1000001  P00087842             A                          2
3       1000001  P00085442             A                          2
4       1000002  P00285442             C                         4+
...         ...        ...           ...                        ...
550063  1006033  P00372445             B                          1
550064  1006035  P00375436             C                          3
550065  1006036  P00375436             B                         4+
550066  1006038  P00375436             C                          2
550067  1006039  P00371644             B                         4+

        Marital_Status  Product_Category_1  Product_Category_2  \
0                    0                   3                 NaN
1                    0                   1                 6.0
2                    0                  12                 NaN
3                    0                  12                14.0
4                    0                   8                 NaN
...                ...                 ...                 ...
550063               1                  20                 NaN
550064               0                  20                 NaN
550065               1                  20                 NaN
550066               0                  20                 NaN
550067               1                  20                 NaN

        Product_Category_3  Purchase
0                      NaN      8370
1                     14.0     15200
2                      NaN      1422
3                      NaN      1057
4                      NaN      7969
...                    ...       ...
550063                 NaN       368
550064                 NaN       371
550065                 NaN       137
550066                 NaN       365
550067                 NaN       490

[550068 rows x 9 columns]>

In [25]:
print(df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 9 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   City_Category               550068 non-null  object
 3   Stay_In_Current_City_Years  550068 non-null  object
 4   Marital_Status              550068 non-null  int64
 5   Product_Category_1          550068 non-null  int64
 6   Product_Category_2          376430 non-null  float64
 7   Product_Category_3          166821 non-null  float64
 8   Purchase                    550068 non-null  int64
dtypes: float64(2), int64(4), object(3)
memory usage: 37.8+ MB
None

In [26]:
print(df2.describe())

            User_ID  Marital_Status  Product_Category_1  Product_Category_2  \
count  5.500680e+05   550068.000000       550068.000000       376430.000000
mean   1.003029e+06        0.409653            5.404270            9.842329
std    1.727592e+03        0.491770            3.936211            5.086590
min    1.000001e+06        0.000000            1.000000            2.000000
25%    1.001516e+06        0.000000            1.000000            5.000000
50%    1.003077e+06        0.000000            5.000000            9.000000
75%    1.004478e+06        1.000000            8.000000           15.000000
max    1.006040e+06        1.000000           20.000000           18.000000

       Product_Category_3       Purchase
count       166821.000000  550068.000000
mean            12.668243    9263.968713
std              4.125338    5023.065394
min              3.000000      12.000000
25%              9.000000    5823.000000
50%             14.000000    8047.000000
75%             16.000000   12054.000000
max             18.000000   23961.000000

In [27]:
print(df1.shape)

(5891, 4)

c. Data cleaning: <br/>
* Identify and handle missing values, outliers, and inconsistent data. <br/>
* Implement appropriate techniques to clean the data, such as dropping or imputing missing 
values, removing outliers, and addressing inconsistent entries.

In [34]:
# missing values in data
print('user demographics- \n',df1.isnull().sum())
print('\n\nuser purchase details - \n',df2.isnull().sum())

user demographics-
 User_ID       0
Gender        0
Age           0
Occupation    0
dtype: int64


user purchase details -
 User_ID                            0
Product_ID                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [35]:
# duplicated values in data
print('user demographics- \n',df1.duplicated().sum())
print('\n\nuser purchase details - \n',df2.duplicated().sum())

user demographics-
 0


user purchase details -
 0